Revit 2027 API
ReferenceableViewUtils Class
 Utilities related to reference views such as reference sections and reference callouts.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReferenceableViewUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ReferenceableViewUtils
Public NotInheritable Class ReferenceableViewUtils
public ref class ReferenceableViewUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ReferenceableViewUtils = class end
The ReferenceableViewUtils type exposes the following members.
Methods
Name | Description
ChangeReferencedView |  Changes a particular reference view (such as a reference section or reference callout) to refer to a different View.
GetReferencedViewId |  Gets the id of the view referenced by a reference view (such as a reference section or reference callout).
Top
See Also
Reference
Autodesk.Revit.DB Namespace